app/views/events/show.html.erb

  <h2>Date: <%= @event.date %></h2>
  <% @event.reminders.each do |reminder| %>
---
SELECT "reminders".* FROM "reminders" WHERE "reminders"."event_id" = ?  [["event_id", 8]]