app/controllers/events_controller.rb

  def create
     @event = Event.new(event_params)
    if @event.save
---
INSERT INTO "events" ("title", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", ""], ["date", nil], ["created_at", "2025-08-29 00:55:03.441957"], ["updated_at", "2025-08-29 00:55:03.441957"]]